''' Синтаксис языка '''

print('Hellow world')
# print('Hellow world 2') коммент

'''
print('Hellow world 2') коммент
'''
print("Hellow world 2")

''' Типы данных '''

int  # Целые числа
1, 2, 3, -1, -2, 3

float  # Числа с плавающей запятой
1.1, 1.7, 2.15, 3.14

bool  # Булевые значения
True
False

str  # Строки - последовательность символов (символ == 2 байта)
'Hello', ' ', 'P1_324'

list  # Списки - последовательность объектов
[1, 3.14, 'Hello world']

tuple  # Кортежи - последовательность неизменяемых объектов
(1, 3.14, 'Hello world')

set  # Множества - последовательность уникальных объектов
{'a', 'b'}

dict  # Словари - список пар "ключ-значение"
{'alex': '123', 'vlad': '456'}
